Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport.h
/**************************************************************************//**
 * @file     rtl8735bh_sport.h
 * @brief    The HAL related definition and macros for the SPORT device.
 *           Includes Registers and data type definition.
 * @version  V1.00
 * @date     2016-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735BH_SPORT_H_
#define _RTL8735BH_SPORT_H_

#ifdef __cplusplus
extern "C" {
#endif


#include "basic_types.h"
#include "rtl8735b_sport_type.h"
#include "rtl8735b_syson_s_type.h"
#include "rtl8735b.h"
#include "hal_irq.h"


/**
  \brief  Define the SPORT port ID.
*/
enum  sport_id_e {
	SPORT_id   =   0x0,
	SPORT_Max_Id  =   0x1
};
typedef uint8_t sport_id_t;

/**
  \brief  Define the SPORT clock source.
*/
enum  sport_clk_src_e {
	SPORT_40MHZ     =   0x0,
	SPORT_98p304KHZ =   0x1,
	SPORT_45p158KHZ =   0x2
};
typedef uint8_t sport_clk_src_t;

/**
  \brief  Define the SPORT sample rate.
*/
enum sport_rate_e {
	R_8KHZ    = 0x07,
	R_11p025KHZ = 0x0d,
	R_12KHZ   = 0x0b,
	R_16KHZ   = 0x05,
	R_24KHZ   = 0x0a,
	R_22p05KHZ  = 0x0c,
	R_32KHZ   = 0x03,
	R_44p1KHZ = 0x08,
	R_48KHZ   = 0x00,
	R_88p2KHZ = 0x09,
	R_96KHZ   = 0x01,

	R_1KHZ    = 0x10,
	R_4KHZ    = 0x11,
	R_192KHZ  = 0x12,
	R_384KHZ  = 0x13,
	R_7p35KHZ = 0x14,
	R_14p7KHZ = 0x15,
	R_29p4KHZ = 0x16,
	R_58p8KHZ = 0x17,
	R_176p4KHZ  = 0x18
};
typedef uint32_t sport_rate_t;

/**
  \brief SPORT Device Mode.
*/
enum  sport_dev_mode_e {
	SPORT_MASTER_MODE =   0x0,
	SPORT_SLAVE_MODE  =   0x1
};
typedef uint8_t sport_dev_mode_t;

/**
  \brief SPORT Work Mode.
*/
enum  sport_wk_mode_e {
	SPORT_DMA_MODE =   0x0,
	SPORT_FIFO_MODE  =   0x1
};
typedef uint8_t sport_wk_mode_t;

/**
  \brief SPORT Channel Select.
*/
enum  sport_sel_ch_e {
	SPORT_L_R = 0x0,
	SPORT_R_L = 0x1,
	SPORT_L_L = 0x2,
	SPORT_R_R = 0x3
};
typedef uint8_t sport_sel_ch_t;

/**
  \brief SPORT Format.
*/
enum  sport_format_e {
	SPORT_I2S          =   0x0,
	SPORT_LEFT_JUST    =   0x1,
	SPORT_PCM_MODE_A   =   0x2,
	SPORT_PCM_MODE_B   =   0x3
};
typedef uint8_t sport_format_t;

/**
  \brief SPORT Data Length.
*/
enum  sport_dl_e {
	SPORT_DL_16BIT = 0x00,
	SPORT_DL_20BIT = 0x01,
	SPORT_DL_24BIT = 0x02,
	SPORT_DL_32BIT = 0x04
};
typedef uint8_t sport_dl_t;

/**
  \brief SPORT Channel Length.
*/
enum  sport_cl_e {
	SPORT_CL_16BIT = 0x00,
	SPORT_CL_20BIT = 0x01,
	SPORT_CL_24BIT = 0x02,
	SPORT_CL_32BIT = 0x04
};
typedef uint8_t sport_cl_t;

/**
  \brief SPORT Data MSB or LSB.
*/
enum  sport_ml_e {
	SPORT_MSB_FIRST = 0x00,
	SPORT_LSB_FIRST = 0x01
};
typedef uint8_t sport_ml_t;

/**
  \brief SPORT Mclk Rate
*/
enum  sport_mclk_e {
	SPORT_SRC_DIV_2 = 0x00,
	SPORT_SRC_DIV_1 = 0x01,
	SPORT_SRC_DIV_4 = 0x02
};
typedef uint8_t sport_mclk_t;

/**
  \brief SPORT TDM Mode
*/
enum  sport_tdm_e {
	SPORT_NO_TDM = 0x00,
	SPORT_4_TDM = 0x01,
	SPORT_6_TDM = 0x02,
	SPORT_8_TDM = 0x03
};
typedef uint8_t sport_tdm_t;

/**
  \brief SPORT Channel Number
*/
enum sport_ch_e {
	CH_1_MONO   = 0x00,
	CH_2_STEREO = 0x01,
	CH_4        = 0x02,
	CH_6        = 0x03,
	CH_8        = 0x04
};
typedef uint8_t sport_ch_t;

/**
  \brief SPORT Burst Size
*/
enum sport_burst_size_e {
	SPORT_BURST_16  = 0x00,
	SPORT_BURST_8   = 0x01,
	SPORT_BURST_4   = 0x02
};
typedef uint8_t sport_burst_size_t;

/**
  \brief  SPORT TX and RX DMA
*/
enum sport_trx_e {
	SPORT_TX0 = 0x00,
	SPORT_TX1 = 0x01,
	SPORT_RX0 = 0x02,
	SPORT_RX1 = 0x03,
};
typedef uint8_t sport_trx_t;

/**
  \brief  SPORT Page Number
*/
enum {
	SPORT_USELESS_PAGE    =   0x0,
	SPORT_2PAGE           =   0x1,
	SPORT_3PAGE           =   0x2,
	SPORT_4PAGE           =   0x3
};
typedef uint8_t sport_page_num;

/**
  \brief  SPORT Page
*/
enum {
	SPORT_PAGE_0    =   0x1,
	SPORT_PAGE_1    =   0x2,
	SPORT_PAGE_2    =   0x4,
	SPORT_PAGE_3    =   0x8
};
typedef uint8_t sport_page;

/**
  \brief  SPORT Fixed Bclk Select
*/
enum {
	SPORT_BCLK_1D4    =   0x0,
	SPORT_BCLK_1D2    =   0x1
};
typedef uint8_t sport_fixed_bclk_t;

/**
  \brief  The sport tx parameter structure
*/
typedef struct hal_sport_tx_params_s {
	sport_ch_t    sport_tx_ch;      /* TX channel number*/
	sport_cl_t    sport_tx_cl;      /* TX channel length*/
	sport_dl_t    sport_tx0_dl;     /* TX data length for FIFO_0 */
	sport_dl_t    sport_tx1_dl;     /* TX data length for FIFO_1*/
	sport_rate_t  sport_tx_rate;    /* TX sample rate*/
} hal_sport_tx_params_t, *phal_sport_tx_params_t;

/**
  \brief  The sport rx parameter structure
*/
typedef struct hal_sport_rx_params_s {
	sport_ch_t    sport_rx_ch;      /* RX channel number*/
	sport_cl_t    sport_rx_cl;      /* RX channel length*/
	sport_dl_t    sport_rx0_dl;     /* RX data length for FIFO_0 */
	sport_dl_t    sport_rx1_dl;     /* RX data length for FIFO_1*/
	sport_rate_t  sport_rx_rate;    /* RX sample rate*/
} hal_sport_rx_params_t, *phal_sport_rx_params_t;

/**
  \brief  The sport buffer parameter structure
*/
typedef struct hal_sport_buf_params_s {
	u8      *tx0_buf;       /* TX FIFO_0 buffer*/
	u8      *rx0_buf;       /* RX FIFO_0 buffer*/
	u8      *tx1_buf;       /* TX FIFO_1 buffer*/
	u8      *rx1_buf;       /* RX FIFO_1 buffer*/
	u32     page_num;       /* Buffer page number*/
	u32     page_size;      /* Buffer page size*/
} hal_sport_buf_params_t, *phal_sport_buf_params_t;

/**
  \brief  The sport page interrupts
*/
typedef struct hal_sport_page_intr_s {
	u8    sport_p0ok;       /* Page 0 OK Interrupt Enabler*/
	u8    sport_p1ok;       /* Page 1 OK Interrupt Enabler*/
	u8    sport_p2ok;       /* Page 2 OK Interrupt Enabler*/
	u8    sport_p3ok;       /* Page 3 OK Interrupt Enabler*/
	u8    sport_p0unava;    /* PAGE 0 unavailable Interrupt Enable*/
	u8    sport_p1unava;    /* PAGE 1 unavailable Interrupt Enable*/
	u8    sport_p2unava;    /* PAGE 2 unavailable Interrupt Enable*/
	u8    sport_p3unava;    /* PAGE 3 unavailable Interrupt Enabler*/
	u8    sport_p0err;      /* PAGE 0 error Interrupt Enable*/
	u8    sport_p1err;      /* PAGE 1 error Interrupt Enable*/
	u8    sport_p2err;      /* PAGE 2 error Interrupt Enable*/
	u8    sport_p3err;      /* PAGE 3 error Interrupt Enabler*/
	u8    sport_fifo_err;   /* FIFO Underflow or Overflow Interrupt Enable*/
} hal_sport_page_intr_t, *phal_sport_page_intr_t;

/**
  \brief  The sport TX FIFO interrupts
*/
typedef struct hal_sport_tx_fifo_intr_s {
	u8    sport_th_tx0;     /* TX0 Threshold  Interrupt Enabler*/
	u8    sport_full_tx0;   /* TX0 Full Interrupt Enabler*/
	u8    sport_empty_tx0;  /* TX0 Empty Interrupt Enabler*/
	u8    sport_idle_tx0;   /* TX0 Idle OK Interrupt Enabler*/
	u8    sport_th_tx1;     /* TX1 Threshold  Interrupt Enabler*/
	u8    sport_full_tx1;   /* TX1 Full Interrupt Enabler*/
	u8    sport_empty_tx1;  /* TX1 Empty Interrupt Enabler*/
	u8    sport_idle_tx1;   /* TX1 Idle OK Interrupt Enabler*/
} hal_sport_tx_fifo_intr_t, *phal_sport_tx_fifo_intr_t;

/**
  \brief  The sport RX FIFO interrupts
*/
typedef struct hal_sport_rx_fifo_intr_s {
	u8    sport_th_rx0;     /* RX0 Threshold  Interrupt Enabler*/
	u8    sport_full_rx0;   /* R0 Full Interrupt Enabler*/
	u8    sport_empty_rx0;  /* RX0 Empty Interrupt Enabler*/
	u8    sport_th_rx1;     /* RX1 Threshold  Interrupt Enabler*/
	u8    sport_full_rx1;   /* RX1 Full Interrupt Enabler*/
	u8    sport_empty_rx1;  /* RX1 Empty Interrupt Enabler*/
} hal_sport_rx_fifo_intr_t, *phal_sport_rx_fifo_intr_t;

typedef struct hal_sport_init_dat_s {
	u32                 sport_data_byte_cnt;  /*SPORT transfer byte count*/

	u8                  *sport_tx0_data;       /*SPORT Tx data pointer*/
	u8                  *sport_rx0_data;       /*SPORT Rx data pointer*/
	u8                  *sport_tx1_data;       /*SPORT Tx data pointer*/
	u8                  *sport_rx1_data;       /*SPORT Rx data pointer*/

	u8                  sport_tx0_idx;         /*SPORT TX0 page index */
	u8                  sport_rx0_idx;         /*SPORT RX0 page index */
	u8                  sport_tx1_idx;         /*SPORT TX1 page index */
	u8                  sport_rx1_idx;         /*SPORT RX1 page index */
	u8                  sport_hw_tx0_idx;      /*SPORT HW TX0 page index */
	u8                  sport_hw_rx0_idx;      /*SPORT HW RX0 page index */
	u8                  sport_hw_tx1_idx;      /*SPORT HW TX1 page index */
	u8                  sport_hw_rx1_idx;      /*SPORT HW RX1 page index */
} hal_sport_init_dat_t, *phal_sport_init_dat_t;

/**
  \brief  SPORT call back function for the interrupt event.
*/
typedef void (*sport_irq_user_cb_t)(u32 *arg, u8 *pbuf);


typedef struct hal_sport_adapter_s {
	SPORT_Type *base_addr;      /*! The SPORT register base address */

