Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport.h
	return psport_reg->SPORT_SP_TX0_DMA_INT_STA;

}

/**
 *  @brief Get the DMA interrupt status of TX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return psport_reg->SPORT_SP_TX1_DMA_INT_STA;

}

/**
 *  @brief Get the DMA interrupt status of RX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX0 interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return psport_reg->SPORT_SP_RX0_DMA_INT_STA;

}

/**
 *  @brief Get the DMA interrupt status of RX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return psport_reg->SPORT_SP_RX1_DMA_INT_STA;

}

/**
 *  @brief Get the DMA error interrupt status of TX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX0 error interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_dma_err_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_TX0_DMA_INT_STA & 0xF0F00);

}

/**
 *  @brief Get the DMA error interrupt status of TX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 error interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_dma_err_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_TX1_DMA_INT_STA & 0xF0F00);

}

/**
 *  @brief Get the DMA error interrupt status of RX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX0 error interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_dma_err_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_RX0_DMA_INT_STA & 0xF0F00);

}

/**
 *  @brief Get the DMA error interrupt status of RX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 error interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_dma_err_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_RX1_DMA_INT_STA & 0xF0F00);

}

/**
 *  @brief Get the DMA page interrupt status of TX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX0 page interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_dma_page_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_TX0_DMA_INT_STA & 0x0f);

}

/**
 *  @brief Get the DMA page interrupt status of TX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 page interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_dma_page_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_TX1_DMA_INT_STA & 0x0f);

}

/**
 *  @brief Get the DMA page interrupt status of RX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX0 page interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_dma_page_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_RX0_DMA_INT_STA & 0x0f);

}

/**
 *  @brief Get the DMA page interrupt status of RX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 page interrupt status
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_dma_page_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_RX1_DMA_INT_STA & 0x0f);

}

/**
 *  @brief Clear the DMA interrupt status of TX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX0_DMA_INT_STA;

	psport_reg->SPORT_SP_TX0_DMA_INT_STA = temp_reg;

}

/**
 *  @brief Clear the DMA interrupt status of TX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_TX1_DMA_INT_STA;

	psport_reg->SPORT_SP_TX1_DMA_INT_STA = temp_reg;

}

/**
 *  @brief Clear the DMA interrupt status of RX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx0_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_RX0_DMA_INT_STA;

	psport_reg->SPORT_SP_RX0_DMA_INT_STA = temp_reg;

}

/**
 *  @brief Clear the DMA interrupt status of RX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx1_dma_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_RX1_DMA_INT_STA;

	psport_reg->SPORT_SP_RX1_DMA_INT_STA = temp_reg;

}

/**
 *  @brief Clear the DMA page n status of TX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] page Set page n
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_page_intr(hal_sport_adapter_t *psport_adapter, sport_page page)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_TX0_DMA_INT_STA &= page;

