Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport.h
}

/**
 *  @brief Clear the DMA page n status of TX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] page Set page n
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_page_intr(hal_sport_adapter_t *psport_adapter, sport_page page)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_TX1_DMA_INT_STA &= page;

}

/**
 *  @brief Clear the DMA page n status of RX0.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] page Set page n
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx0_page_intr(hal_sport_adapter_t *psport_adapter, sport_page page)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_RX0_DMA_INT_STA &= page;

}

/**
 *  @brief Clear the DMA page n status of RX1.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] page Set page n
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx1_page_intr(hal_sport_adapter_t *psport_adapter, sport_page page)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_RX1_DMA_INT_STA &= page;

}

/**
 *  @brief Get the SPORT page number.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  The SPORT page number
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_page_number(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_DMA_CON & SPORT_MASK_SP_PAGE_NUM) >> SPORT_SHIFT_SP_PAGE_NUM;

}

/**
 *  @brief Set TX0 FIFO data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx0_data Set TX0 data
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_set_tx0_fifo(hal_sport_adapter_t *psport_adapter, u32 tx0_data)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_TX_FIFO_0 = tx0_data;

}

/**
 *  @brief Set TX1 FIFO data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] tx1_data Set TX1 data
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_set_tx1_fifo(hal_sport_adapter_t *psport_adapter, u32 tx1_data)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_TX_FIFO_1 = tx1_data;

}

/**
 *  @brief Get RX0 FIFO data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx0_data Get RX0 data
 *
 *  @returns  FIFO value
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_fifo(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return psport_reg->SPORT_SP_RX_FIFO_0;

}

/**
 *  @brief Get RX1 FIFO data.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *  @param[in] rx1_data Get RX1 data
 *
 *  @returns  FIFO value
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_fifo(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return psport_reg->SPORT_SP_RX_FIFO_1;

}

/**
 *  @brief Get TX FIFO_0 depth status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  When TX FIFO_0 is empty, this value shows 32.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_depth_cnt(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_FIFO_CNT_STA & SPORT_MASK_SP_TX_DEPTH_CNT_0) >> SPORT_SHIFT_SP_TX_DEPTH_CNT_0;

}

/**
 *  @brief Get RX FIFO_0 depth status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  When RX FIFO_0 is full, this value shows 32.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_depth_cnt(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_FIFO_CNT_STA & SPORT_MASK_SP_RX_DEPTH_CNT_0) >> SPORT_SHIFT_SP_RX_DEPTH_CNT_0;

}

/**
 *  @brief Get TX FIFO_1 depth status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  When TX FIFO_1 is empty, this value shows 32.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_depth_cnt(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_FIFO_CNT_STA & SPORT_MASK_SP_TX_DEPTH_CNT_1) >> SPORT_SHIFT_SP_TX_DEPTH_CNT_1;

}

/**
 *  @brief Get RX FIFO_1 depth status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  When RX FIFO_1 is full, this value shows 32.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_depth_cnt(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_FIFO_CNT_STA & SPORT_MASK_SP_RX_DEPTH_CNT_1) >> SPORT_SHIFT_SP_RX_DEPTH_CNT_1;

}

/**
 *  @brief Clear TX0 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_0);
}

/**
 *  @brief Clear RX0 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx0_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_0);
}

/**
 *  @brief Clear TX0 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_0);
}

/**
 *  @brief Clear RX0 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx0_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_0);
}

/**
 *  @brief Clear TX0 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_0);
}

/**
 *  @brief Clear RX0 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx0_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_0);
}

/**
 *  @brief Clear TX0 idle interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx0_idle_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_IDLE_INTR_0;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_IDLE_INTR_0);
}

/**
 *  @brief Clear TX1 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_1);
}

/**
 *  @brief Clear RX1 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx1_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

