Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport.h
	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_1);
}

/**
 *  @brief Clear TX1 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_1);
}

/**
 *  @brief Clear RX1 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx1_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_1);
}

/**
 *  @brief Clear TX1 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_1);
}

/**
 *  @brief Clear RX1 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_rx1_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_1);
}

/**
 *  @brief Clear TX1 idle interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  void
 */
__STATIC_INLINE
void hal_rtl_sport_clr_tx1_idle_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	psport_reg->SPORT_SP_FIFO_INTR_CON |= SPORT_BIT_SP_CLR_TX_IDLE_INTR_1;
	psport_reg->SPORT_SP_FIFO_INTR_CON &= ~(SPORT_BIT_SP_CLR_TX_IDLE_INTR_1);
}

/**
 *  @brief Get the FIFO interrupt status.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns FIFO interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_fifo_intr_sta(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;

	return (psport_reg->SPORT_SP_FIFO_INTR_STA & 0x3FFF);
}

/**
 *  @brief Get TX0 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  FIFO TX0 TH interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_TH_INTR_0) >> SPORT_SHIFT_SP_TX_FIFO_TH_INTR_0);
}

/**
 *  @brief Get RX0 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  FIFO RX0 TH interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_TH_INTR_0) >> SPORT_SHIFT_SP_RX_FIFO_TH_INTR_0);
}

/**
 *  @brief Get TX0 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  FIFO TX0 full interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_FULL_INTR_0) >> SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_0);
}

/**
 *  @brief Get RX0 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  FIFO RX0 full interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_FULL_INTR_0) >> SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_0);
}

/**
 *  @brief Get TX0 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  FIFO TX0 empty interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_EMPTY_INTR_0) >> SPORT_SHIFT_SP_TX_FIFO_EMPTY_INTR_0);
}

/**
 *  @brief Get RX0 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX0 empty interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx0_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_EMPTY_INTR_0) >> SPORT_SHIFT_SP_RX_FIFO_EMPTY_INTR_0);
}

/**
 *  @brief Get TX0 idle interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX0 idle interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx0_idle_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_IDLE_INTR_0) >> SPORT_SHIFT_SP_TX_IDLE_INTR_0);
}

/**
 *  @brief Get TX1 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 TH interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_TH_INTR_1) >> SPORT_SHIFT_SP_TX_FIFO_TH_INTR_1);
}

/**
 *  @brief Get RX1 TH interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 TH interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_th_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_TH_INTR_1) >> SPORT_SHIFT_SP_RX_FIFO_TH_INTR_1);
}

/**
 *  @brief Get TX1 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 full interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_FULL_INTR_1) >> SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_1);
}

/**
 *  @brief Get RX1 full interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 full interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_full_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_FULL_INTR_1) >> SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_1);
}

/**
 *  @brief Get TX1 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 empty interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_FIFO_EMPTY_INTR_1) >> SPORT_SHIFT_SP_TX_FIFO_EMPTY_INTR_1);
}

/**
 *  @brief Get RX1 empty interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  RX1 empty interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_rx1_empty_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_RX_FIFO_EMPTY_INTR_1) >> SPORT_SHIFT_SP_RX_FIFO_EMPTY_INTR_1);
}

/**
 *  @brief Get TX1 idle interrupt.
 *
 *  @param[in] psport_adapter The SPORT adapter.
 *
 *  @returns  TX1 idle interrupt status.
 */
__STATIC_INLINE
u32 hal_rtl_sport_get_tx1_idle_intr(hal_sport_adapter_t *psport_adapter)
{
	SPORT_TypeDef *psport_reg = (SPORT_TypeDef *)psport_adapter->base_addr;
	u32 temp_reg;

	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_CON;
	temp_reg = psport_reg->SPORT_SP_FIFO_INTR_STA & (((temp_reg >> 17) & 0x3F80) | ((temp_reg >> 16) & 0x7F));

	return ((temp_reg & SPORT_BIT_SP_TX_IDLE_INTR_1) >> SPORT_SHIFT_SP_TX_IDLE_INTR_1);
}




#ifdef __cplusplus
}
#endif

#endif  // #ifndef _RTL8735BH_SPORT_H_

